# Customer Shared - Staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./src/customer/shared/infrastructure/workspaces/staging relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/Connectilly/customer-shared-staging/runs/run-vh4HdK5hLRZBYwzt

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
module.database.cockroach_cluster.default: Refreshing state... [id=aea7ce45-45d0-4f49-8033-aed9c13da58e]
module.database.cockroach_database.default: Refreshing state... [id=aea7ce45-45d0-4f49-8033-aed9c13da58e:customer]
module.database.aws_ssm_parameter.default: Refreshing state... [id=customer-shared-staging-customer-cluster-id]
module.database_user.data.aws_ssm_parameter.cluster_id: Refreshing...
module.database_user.random_password.password: Refreshing state... [id=none]
module.database_user.data.aws_ssm_parameter.cluster_id: Refresh complete after 1s [id=customer-shared-staging-customer-cluster-id]
module.database_user.cockroach_sql_user.default: Refreshing state... [id=aea7ce45-45d0-4f49-8033-aed9c13da58e:customer-shared]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "customer"
      + id                = "aea7ce45-45d0-4f49-8033-aed9c13da58e"
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "customer-shared"
    }

  # module.database_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "aea7ce45-45d0-4f49-8033-aed9c13da58e:customer-shared"
        name       = "customer-shared"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.database_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "abf7327b-20e2-4a63-99c3-d8d138ace1ce" -> "bcf07fd0-158e-4ed9-95ff-d97ea26bcc18"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ customer_database_connection_string = (sensitive value)

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*